DataProcessors/ВыгрузкаПоказанийДляТеплосеть.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<DataProcessor>
		<Properties>
			<Name>ВыгрузкаПоказанийДляТеплосеть</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодВыгрузки</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЗдания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлDBF</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТабличнаяЧасть</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>NO_OS</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>7</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>FIO</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ADRES</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TELEFON</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>NOM_LICH</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>BEGMETRDAT</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ENDMETRDAT</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>BEGINMETR</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ENDMETR</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ПоказанияПриборовУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ПоказанияПриборовУчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отключен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИсточникиПоказаний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/РасчетПоказанийПриборовУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетПоказанийПриборовУчета</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектУстановки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КорректировкаПоказаний</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Энергоемкость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

DataProcessors/ВыгрузкаПоказанийДляТеплосеть/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ФайлDBFНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Фильтр                      = НСтр("ru='Файл XBase (*.dbf)|*.dbf'");
	ДиалогВыбораФайла.Заголовок                   = Заголовок;
	ДиалогВыбораФайла.ПредварительныйПросмотр     = Ложь;
	ДиалогВыбораФайла.Расширение                  = "dbf";
	ДиалогВыбораФайла.ИндексФильтра               = 0;
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла = Ложь;
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
	    Объект.ФайлDBF = ДиалогВыбораФайла.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВDBF(Команда)
	Файл = Новый XBase;
	Файл.Кодировка = КодировкаXBase.OEM;
	Файл.поля.Добавить("NO_OS","C",7,0);
	Файл.поля.Добавить("FIO","C",30,0);
	Файл.поля.Добавить("ADRES","C",100,0);
	Файл.поля.Добавить("TELEFON","C",20,0);
	Файл.поля.Добавить("NOM_LICH","C",20,0);
	Файл.поля.Добавить("BEGMETRDAT","D",8,0);
	Файл.поля.Добавить("ENDMETRDAT","D",8,0);
	Файл.поля.Добавить("BEGINMETR","N",12,0);
	Файл.поля.Добавить("ENDMETR","N",12,0);
	ПолучитьПриборыУчета();
	
	Если НЕ ЗначениеЗаполнено(Объект.ФайлDBF) Тогда
		Предупреждение("Не вказано файл для зберігання. Вкажіть ім'я файлу.");
		Возврат;
	КонецЕсли;
	Попытка
		Файл.СоздатьФайл(Объект.ФайлDBF);
	Исключение
		Предупреждение("Помилка створення файлу " + Файл);
		Возврат;
	КонецПопытки;

	Для Каждого стр Из Объект.ТабличнаяЧасть Цикл
		Файл.Добавить();
		Файл.NO_OS      = Строка(стр.NO_OS);
		Файл.FIO        = Строка(стр.FIO);
		Файл.ADRES      = Строка(стр.ADRES);
		Файл.TELEFON    = Строка(стр.TELEFON);
		Файл.NOM_LICH   = (СтрЗаменить(Строка(стр.NOM_LICH), Символы.НПП, ""));
		Файл.BEGMETRDAT = Объект.ПериодВыгрузки.ДатаНачала;
		Файл.ENDMETRDAT = Объект.ПериодВыгрузки.ДатаОкончания;
		Файл.BEGINMETR  = Число(стр.BEGINMETR);
		Файл.ENDMETR    = Число(стр.ENDMETR);
		Файл.Записать();
	КонецЦикла;
	Файл.ЗакрытьФайл();
	Предупреждение("Файл " + Файл + " успішно створений.");
КонецПроцедуры



//////////////////////////////////////////////////////////////////////////////////////////////////////
&НаСервере
Процедура ПолучитьПриборыУчета()
	тзДанные = Новый ТаблицаЗначений;
	тзДанные.Колонки.Добавить("ЛицевойСчет",     Новый ОписаниеТипов("СправочникСсылка.ЛицевыеСчета"), "ЛицевойСчет");
	тзДанные.Колонки.Добавить("НомерПрибора",    Новый ОписаниеТипов("Число"), "НомерПрибора");
	тзДанные.Колонки.Добавить("Адрес",           Новый ОписаниеТипов("СправочникСсылка.ЗданияИСооружения"), "Адрес");
	тзДанные.Колонки.Добавить("ТелеФон",         Новый ОписаниеТипов("Строка"), "Телефон");
	тзДанные.Колонки.Добавить("Квартира",        Новый ОписаниеТипов("СправочникСсылка.ОбъектыЛицевыхСчетов"), "Квартира");
	тзДанные.Колонки.Добавить("ФИО",             Новый ОписаниеТипов("СправочникСсылка.ПотребителиУслуг"), "ФИО");
	тзДанные.Колонки.Добавить("Показания",       Новый ОписаниеТипов("Число"), "Показания");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	    "ВЫБРАТЬ
	    |	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.ЗаводскойНомер КАК НомерПрибора,
	    |	УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки КАК ЛицевойСчет,
	    |	УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки.Владелец КАК Адрес,
	    |	УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки.ОбъектЛицевогоСчета КАК Квартира,
	    |	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец КАК ФИО,
	    |	ПоказанияПриборовУчетаСрезПоследних.Значение КАК Показания,
	    |	УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки.МобТелефон КАК Телефон
	    |ИЗ
	    |	РегистрСведений.УстановленныеПриборыУчета.СрезПоследних(
	    |			&НаДату,
	    |			ПриборУчета.Услуга.ВидУслуги = &ВидУслуги
	    |				И Действует = ИСТИНА) КАК УстановленныеПриборыУчетаСрезПоследних
	    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПоказанияПриборовУчета.СрезПоследних(&НаДату, ) КАК ПоказанияПриборовУчетаСрезПоследних
	    |		ПО УстановленныеПриборыУчетаСрезПоследних.ПриборУчета = ПоказанияПриборовУчетаСрезПоследних.ПриборУчета
	    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(&НаДату, ) КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
	    |		ПО УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки = ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет";
	Запрос.УстановитьПараметр("НаДату", Объект.ПериодВыгрузки.ДатаНачала);
	Запрос.УстановитьПараметр("ВидУслуги", Справочники.ВидыУслуг.Водоотведение);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий()Цикл
		НовСтрока = тзДанные.Добавить();
		НовСтрока.ЛицевойСчет = Выборка.ЛицевойСчет;
		НовСтрока.НомерПрибора = (СтрЗаменить(Строка(Выборка.НомерПрибора), Символы.НПП, ""));
		НовСтрока.Адрес = Выборка.Адрес;
		НовСтрока.ТелеФон = Выборка.ТелеФон;
		НовСтрока.Квартира = Выборка.Квартира;
		НовСтрока.ФИО = Выборка.ФИО;
		НовСтрока.Показания = Выборка.Показания;
	КонецЦикла;
	
	тзДанные.Колонки.Добавить("КвоКубов", Новый ОписаниеТипов("Число"), "КвоКубов");
	тзДанные.Колонки.Добавить("ПоказанияНачальные", Новый ОписаниеТипов("Число"), "ПоказанияНачальные");
	
	Для Каждого стр Из тзДанные Цикл
		Запрос = Новый Запрос;
		Запрос.Текст = 
		    "ВЫБРАТЬ
		    |	РасчетПоказанийПриборовУчета.Значение КАК Количество
		    |ИЗ
		    |	РегистрНакопления.РасчетПоказанийПриборовУчета КАК РасчетПоказанийПриборовУчета
		    |ГДЕ
		    |	РасчетПоказанийПриборовУчета.Период МЕЖДУ &НачПериода И &КонПериода
		    |	И РасчетПоказанийПриборовУчета.Услуга = &Услуга
		    |	И РасчетПоказанийПриборовУчета.ВидДвижения = &ВидДвижения
		    |	И РасчетПоказанийПриборовУчета.ОбъектУстановки = &ЛицевойСчет";
		Запрос.УстановитьПараметр("ЛицевойСчет", стр.ЛицевойСчет);
		Запрос.УстановитьПараметр("Услуга", Справочники.Услуги.НайтиПоКоду("000000020"));
		Запрос.УстановитьПараметр("НачПериода", Объект.ПериодВыгрузки.ДатаНачала);
		Запрос.УстановитьПараметр("КонПериода", КонецДня(Объект.ПериодВыгрузки.ДатаОкончания));
		Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Приход);
		Результат = Запрос.Выполнить().Выгрузить();
		Если Результат.Количество() <> 0 Тогда
			стр.КвоКубов = Результат[0].Количество;
			стр.ПоказанияНачальные = стр.Показания - стр.КвоКубов;
		Иначе
			стр.ПоказанияНачальные = стр.Показания;
		КонецЕсли;
		
		НовСтр = Объект.ТабличнаяЧасть.Добавить();
		НовСтр.NO_OS = Строка(стр.ЛицевойСчет);
		НовСтр.FIO   = Строка(стр.ФИО);
		НовСтр.ADRES = Строка(стр.Адрес) + " " + Строка(стр.Квартира);
		НовСтр.TELEFON = Строка(стр.Телефон);
		НовСтр.NOM_LICH = (СтрЗаменить(Строка(стр.НомерПрибора), Символы.НПП, ""));
		НовСтр.BEGMETRDAT = Объект.ПериодВыгрузки.ДатаНачала;
		НовСтр.ENDMETRDAT = Объект.ПериодВыгрузки.ДатаОкончания;
		НовСтр.BEGINMETR  = стр.ПоказанияНачальные;
		НовСтр.ENDMETR    = стр.Показания;
	КонецЦикла;
КонецПроцедуры
